[
    {
        "_id": "hiking",
        "name": "Hiking",
        "description": "Hiking is a popular outdoor activity enjoyed in natural landscapes such as forests, mountains, and national parks."
    },
    {
        "_id": "walking",
        "name": "Walking",
        "description": "Walking is an accessible activity, often enjoyed in parks, cities, or along scenic routes for leisure or fitness."
    },
    {
        "_id": "soccer",
        "name": "Soccer",
        "description": "Soccer is the most popular sport worldwide, uniting people through playing informal matches and supporting teams."
    },
    {
        "_id": "swimming",
        "name": "Swimming",
        "description": "Swimming is a recreational and fitness activity, often enjoyed at beaches, pools, and rivers."
    },
    {
        "_id": "dancing",
        "name": "Dancing",
        "description": "Dancing is a cultural and social activity that brings people together at events, festivals, or informal gatherings."
    },
    {
        "_id": "jogging",
        "name": "Jogging",
        "description": "Jogging is a common fitness activity enjoyed in urban areas, parks, and along scenic paths."
    },
    {
        "_id": "cricket",
        "name": "Cricket",
        "description": "Cricket is a bat-and-ball game with deep cultural roots, often played in local fields or parks."
    },
    {
        "_id": "ice_hockey",
        "name": "Ice Hockey",
        "description": "Ice Hockey is a fast-paced team sport played on ice, often during winter months in colder climates."
    },
    {
        "_id": "table_tennis",
        "name": "Table Tennis",
        "description": "Table Tennis, also known as ping pong, is a fast-paced indoor sport played with paddles and a small ball."
    },
    {
        "_id": "muay_thai",
        "name": "Muay Thai",
        "description": "Muay Thai is a traditional martial art and combat sport, widely practiced for fitness and competition."
    },
    {
        "_id": "basketball",
        "name": "Basketball",
        "description": "Basketball is a team sport commonly played on public courts, in schools, and professional arenas."
    },
    {
        "_id": "rugby",
        "name": "Rugby",
        "description": "Rugby is a physical team sport played with an oval ball, known for its passionate fans and traditions."
    },
    {
        "_id": "long_distance_running",
        "name": "Long Distance Running",
        "description": "Long-distance running is a popular endurance sport and fitness activity, often enjoyed in marathons and scenic routes."
    },
    {
        "_id": "australian_rules_football",
        "name": "Australian Rules Football",
        "description": "Australian Rules Football is a dynamic team sport unique to Australia, blending elements of soccer and rugby."
    },
    {
        "_id": "sumo_wrestling",
        "name": "Sumo Wrestling",
        "description": "Sumo Wrestling is a traditional Japanese combat sport, deeply rooted in cultural and ritual practices."
    },
    {
        "_id": "field_hockey",
        "name": "Field Hockey",
        "description": "Field Hockey is a widely played team sport, involving skillful ball control with a stick on a grass or turf field."
    },
    {
        "_id": "camel_racing",
        "name": "Camel Racing",
        "description": "Camel Racing is a traditional cultural sport popular in desert regions, celebrating heritage and community."
    },
    {
        "_id": "oil_wrestling",
        "name": "Oil Wrestling",
        "description": "Oil Wrestling is a historic cultural sport involving skill and strength, with roots in traditional ceremonies."
    },
    {
        "_id": "tejo",
        "name": "Tejo",
        "description": "Tejo is a traditional sport combining skill and precision, often enjoyed in social gatherings and festivals."
    },
    {
        "_id": "paleta_fronton",
        "name": "Paleta Frontón",
        "description": "Paleta Frontón is a traditional racquet sport played in public spaces and sports facilities."
    }
]
