[
    {
        "_id": "canada",
        "name": "Canada",
        "healthcare_structure": "Universal",
        "healthcare_description": "Great accessibility for all citizens. Systems struggles in being efficient and faces challenges to find funding.",
        "obesity_rating": "27.32%",
        "activity_ids": ["hiking"]
    },
    {
        "_id": "costa rica",
        "name": "Costa Rica",
        "healthcare_structure": "Universal",
        "healthcare_description": "exceptional quality compared to the wealthier counties in the region. There is still a lack of general and specialists physicians in the county leading to a decrease in overall efficiency.",
        "obesity_rating": "31.97%",
        "activity_ids": ["walking"]
    },
    {
        "_id": "united states",
        "name": "United States",
        "healthcare_structure": "Mixed",
        "healthcare_description": "Emphasis on private health insurance. Quality and efficiency can vary tremendously between two insurance providers.",
        "obesity_rating": "42.87%",
        "activity_ids": ["walking"]
    },
    {
        "_id": "mexico",
        "name": "Mexico",
        "healthcare_structure": "Dual",
        "healthcare_description": "Access to premium health insurance is difficult to find and afford for most citizens.",
        "obesity_rating": "36.09%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "panama",
        "name": "Panama",
        "healthcare_structure": "Dual",
        "healthcare_description": "Panama is the leader in health care in Central America. Although the system may lack efficiency in underserved regions, the services provided are quality.",
        "obesity_rating": "27.32%",
        "activity_ids": ["swimming"]
    },
    {
        "_id": "columbia",
        "name": "Columbia",
        "healthcare_structure": "Dual",
        "healthcare_description": "Columbia ranks really well regionally and internationally. The country can struggle with providing quality access to health services in certain regions.",
        "obesity_rating": "23.85%",
        "activity_ids": ["dancing"]
    },
    {
        "_id": "peru",
        "name": "Peru",
        "healthcare_structure": "Mixed",
        "healthcare_description": "Private health care is well-developed. The majority of citizens are on public health care plans which struggles for funding and ability to make services accessible to everyone.",
        "obesity_rating": "27.18%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "brazil",
        "name": "Brazil",
        "healthcare_structure": "Universal",
        "healthcare_description": "The country has made significant strides to improve its health care in recent years, providing one of the world’s largest public health system. The country, like many in the region, still struggle with overcrowding, underfunding, and uneven distribution of resources.",
        "obesity_rating": "28.76%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "argentina",
        "name": "Argentina",
        "healthcare_structure": "Mixed",
        "healthcare_description": "The health care system is overall very well-regarded. The access to health services is vast, the country doesn’t struggle as much is accessibility but the public system is limited is services provided.",
        "obesity_rating": "36.03%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "uruguay",
        "name": "Uruguay",
        "healthcare_structure": "Dual",
        "healthcare_description": "Uruguays health care system is known as one of the best in Latin America. There is a great balance between the public in private sector. Limited access to services in rural areas.",
        "obesity_rating": "34.67%",
        "activity_ids": ["walking"]
    },
    {
        "_id": "united kingdom",
        "name": "United Kingdom",
        "healthcare_structure": "Universal",
        "healthcare_description": "Public health system provides a lot of services but there are certain services where citizens will have to pay out of pocket. UK’s universal systems struggles in funding issues, rising demand for services, and workforce shortages.",
        "obesity_rating": "28.71%",
        "activity_ids": ["walking"]
    },
    {
        "_id": "germany",
        "name": "Germany",
        "healthcare_structure": "Dual",
        "healthcare_description": "Based on a dual system of public (statutory) health insurance and private health insurance, with compulsory coverage for all residents.  Considered one of the best health care systems in the world with very few drawbacks.",
        "obesity_rating": "24.16%",
        "activity_ids": ["hiking"]
    },
    {
        "_id": "italy",
        "name": "Italy",
        "healthcare_structure": "Universal",
        "healthcare_description": "The system provides robust insurance plans, with some out of pocket costs. The system has been praised for its efficiency and the quality of care, and Italy consistently ranks well in international comparisons of healthcare systems.",
        "obesity_rating": "21.55%",
        "activity_ids": ["walking"]
    },
    {
        "_id": "norway",
        "name": "Norway",
        "healthcare_structure": "Mixed",
        "healthcare_description": "With a vast majority of its citizens using the country’s amazing public health system. Norway’s universal health care system is considered one of the best in the world. There once again might be some out of pocket cost for some services, but there are exemptions for vulnerable populations like children and retirees.",
        "obesity_rating": "19.77%",
        "activity_ids": ["hiking"]
    },
    {
        "_id": "turkey",
        "name": "Turkey",
        "healthcare_structure": "Dual",
        "healthcare_description": "Turkey's dual healthcare system is a combination of public and private sectors, with a focus on universal coverage. While the country has made significant advancements, including expanding medical infrastructure and increasing healthcare accessibility, challenges persist. These include workforce shortages, particularly in rural areas, and long waiting times in public facilities.",
        "obesity_rating": "34.26%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "algeria",
        "name": "Algeria",
        "healthcare_structure": "Mixed",
        "healthcare_description": "Algeria's healthcare system is primarily publicly funded, offering universal coverage to all citizens. The public healthcare network struggles with limited resources, outdated medical equipment, and overcrowded facilities, particularly in underserved areas.",
        "obesity_rating": "24.25%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "egypt",
        "name": "Egypt",
        "healthcare_structure": "Mixed",
        "healthcare_description": "The country's health system is a mix of public and private healthcare providers, with the government being the largest service provider. The Egyptian government system has aimed to reduce disparities and increase accessibility to medical care for all Egyptians, especially those in underserved rural areas.",
        "obesity_rating": "42.99%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "nigeria",
        "name": "Nigeria",
        "healthcare_structure": "Dual",
        "healthcare_description": "Nigeria is a dual system between public and private sectors. Nigeria has made some improvements to its universal system but the country is still struggling to provide quality inexpensive services to its citizens.",
        "obesity_rating": "10.84%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "kenya",
        "name": "Kenya",
        "healthcare_structure": "Mixed",
        "healthcare_description": "The country has a mixed healthcare system, combining public, private, and non-profit sectors. However, it struggles with fragmented coordination, especially between national and county-level healthcare providers. This has led to inconsistent service delivery and gaps in patient care.",
        "obesity_rating": "11.04%",
        "activity_ids": ["jogging"]
    },
    {
        "_id": "south africa",
        "name": "South Africa",
        "healthcare_structure": "Dual",
        "healthcare_description": "South Africa's healthcare system is a dual system, consisting of both public and private healthcare sectors. There is a significant disparity in healthcare access between rich and poor, with wealthier individuals benefiting from private healthcare, while the majority rely on the underfunded public system.",
        "obesity_rating": "30.03%",
        "activity_ids": ["hiking"]
    },
    {
        "_id": "saudi arabia",
        "name": "Saudi Arabia",
        "healthcare_structure": "Mixed",
        "healthcare_description": "Saudi Arabia's healthcare system is a mix of public and private services, with the government playing a significant role in providing healthcare to its citizens. The government provides a strong foundation of healthcare services for its citizens, though challenges such as rising rates of chronic diseases, mental health issues, and an aging population require ongoing attention.",
        "obesity_rating": "41.11%",
        "activity_ids": ["soccer"]
    },
    {
        "_id": "pakistan",
        "name": "Pakistan",
        "healthcare_structure": "Mixed",
        "healthcare_description": "Pakistan’s healthcare system is a mix of public and private sector services, with significant challenges in providing universal access to quality care. The system faces issues such as insufficient funding, a shortage of healthcare professionals, and disparities between urban and rural areas.",
        "obesity_rating": "21.85%",
        "activity_ids": ["cricket"]
    },
    {
        "_id": "india",
        "name": "India",
        "healthcare_structure": "Mixed",
        "healthcare_description": "Combining both public and private healthcare sectors. The system faces significant challenges, including an underfunded public sector, disparities in healthcare access between rural and urban areas, and a growing burden of non-communicable diseases.",
        "obesity_rating": "7.21%",
        "activity_ids": ["cricket"]
    },
    {
        "_id": "russia",
        "name": "Russia",
        "healthcare_structure": "Dual",
        "healthcare_description": "Russia's healthcare system is a publicly funded model, with both public and private healthcare providers. The government plays a central role in providing healthcare services, while the private sector offers supplementary services for those who can afford them. The system faces challenges, including underfunding, long wait times in public healthcare facilities, and regional disparities in the availability and quality of services.",
        "obesity_rating": "28.05%",
        "activity_ids": ["ice hockey"]
    },
    {
        "_id": "china",
        "name": "China",
        "healthcare_structure": "Mixed",
        "healthcare_description": "China's healthcare system is a mixed system that combines elements of both public and private care, with the government playing a significant role in providing universal healthcare to its citizens. The system has undergone significant reforms over the past few decades, aiming to expand access to healthcare services, improve quality, and reduce disparities between urban and rural areas.",
        "obesity_rating": "8.21%",
        "activity_ids": ["table tennis"]
    },
    {
        "_id": "japan",
        "name": "Japan",
        "healthcare_structure": "Universal",
        "healthcare_description": "Publicly funded system that provides high-quality healthcare services to all citizens and residents. It is known for its efficiency, longevity outcomes, and low healthcare costs compared to other developed nations.",
        "obesity_rating": "4.94%",
        "activity_ids": ["walking"]
    },
    {
        "_id": "thailand",
        "name": "Thailand",
        "healthcare_structure": "Universal",
        "healthcare_description": "Thailand has a highly regarded healthcare system that provides universal health coverage for its citizens. The country's healthcare system is characterized by its affordability, accessibility, and high-quality care, while also facing challenges related to its aging population and healthcare infrastructure in rural areas.",
        "obesity_rating": "14.51%",
        "activity_ids": ["muay thai"]
    },
    {
        "_id": "philippines",
        "name": "Philippines",
        "healthcare_structure": "Mixed",
        "healthcare_description": "The healthcare system of the Philippines is a mix of public and private services that aims to provide comprehensive medical care to the population. The Philippine government continues to work on reforms and initiatives to address issues and ensure that healthcare is accessible to all Filipinos.",
        "obesity_rating": "8.74%",
        "activity_ids": ["basketball"]
    },
    {
        "_id": "new zealand",
        "name": "New Zealand",
        "healthcare_structure": "Universal",
        "healthcare_description": "New Zealand has a publicly funded healthcare system, which provides access to healthcare services for all residents, regardless of income or employment status. The system combines public healthcare services funded by the government and private healthcare options that individuals can pay for or access through private insurance.",
        "obesity_rating": "34.25%",
        "activity_ids": ["rugby"]
    },
    {
        "_id": "australia",
        "name": "Australia",
        "healthcare_structure": "Universal",
        "healthcare_description": " Australia has a universal healthcare system known as Medicare, which provides all residents and citizens with access to essential medical services. It is a mix of public and private services, with significant government involvement in ensuring that healthcare is affordable and accessible for everyone.",
        "obesity_rating": "31.82%",
        "activity_ids": ["cricket"]
    }
]